[
    {
        "title": "Bitcoin traders expect price pullbacks, but $73K remains the short-term target",
        "content": "Traders expect Bitcoin downside price action to continue but also agree that in the coming weeks, $73,000 could occur “fairly quickly.”\nBitcoinBTC$67,305analysts are eyeing targets just below its current all-time high of $73,679. However, they caution that despite the strong chart structure following its push above $69,000, the road ahead may be volatile.\nBitcoin “is looking incredibly strong right now on the technical front,” digital asset investment platform ZeroCap chief investment officer Jonathan de Wet wrote in an Oct. 22 analyst note viewed by Cointelegraph.\nDe Wet pointed out that Bitcoin has “broken” the descending trendline from June, an observation also pointed out by several other crypto analysts.\n“We practiced patience for months. Uncharted territory, on the horizon,” pseudonymous crypto trader Jellestated.\n“Bitcoin price has been frustrating for many this last 7 months, but has actually allowed the price action to re-enter this zone,” BitLab Academy director Kelly Kallamadded.\nBitcoin has reacted negatively to signs of geopolitical conflict in recent times. On Oct. 3, Cointelegraph reported that after a major missile strike by Iran targeting sites across Israel late on Oct. 1,Bitcoin’s price fell by nearly $4,000.\nHowever, on Oct. 21, Bitcoin spiked above $69,000 for the first time since June 11, which Theodorou sees as a sign that the crypto market is “shaping up for a big week.”\nSince then, it has retraced approximately 2.80%, trading at $67,054 at the time of publication.\nDe Wet explained that once Bitcoin clears the $70,000 mark — which it hasn’t reached since June 7 — it’s likely to see a spike to $72,000 “fairly quickly.”\nAccording to de Wet, breaking through its current all-time high of $73,679 reached in March won’t come without “some chop” along the way. He is confident of the asset breaking through that level before the end of 2024:\n“Do we get above highs prior to the end of the year? We think so.”\nTheodorou noted that the surge “has been fueled” by the recent increase in demand forspot Bitcoin exchange-traded funds (ETF) within the US.\nBetween Oct. 14 and 18, Theodorou highlighted that Bitcoin ETF investors purchased the equivalent of 36,500 BTC, which he reiterated is “more than ten times the daily issuance of 450 BTC.”\n“Essentially, we’re seeing investors buying BTC exponentially faster than it can be mined.",
        "link": "https://www.cointelegraph.com/news/bitcoin-analysts-price-73k-pullbacks-decline-possible",
        "date": "2024-10-22",
        "timestamp": "2024-10-23T01:30:44.997324+08:00"
    },
    {
        "title": "The rise of soulbound NFTs: Unpacking community monetization strategies",
        "content": "Web3 tools and soulbound NFTs are reshaping community monetization by simplifying the integration between digital and physical experiences.\n\nOnline communities have transformed from niche forums into powerful hubs for engagement and brand development, as people seek spaces to connect with shared interests.\nA growing demand for meaningful connections and personalized experiences has fueled this shift, with community site visitsincreasingby 64% over recent years. In addition to fostering user loyalty, the enterprise social networking and online communities market isprojectedto grow from $10.83 billion in 2023 to $25.48 billion by 2032. This surge underscores the need for community platforms to offer more robust, monetizable experiences.\n\nAlthough the market is promising, its potential depends on effective monetization strategies. Traditional models like ads, memberships, and one-time purchases often fall short of capturing the full value of active communities. Expertsbelieveit’s essential to focus on meaningful benefits for members rather than solely rewarding creators.\nTraditional monetization models struggle with high transaction fees, limited payment options and a fragmented user experience. Creators often have to manage memberships, donations and content sales across multiple platforms, resulting in friction and inefficiency.\nAnother pain point is ticketing systems for online and offline events. While platforms charge high fees, payments to organizers are often delayed, hindering cash flow.\nWeb3 technologies andnon-fungible tokens (NFTs)offer promising alternatives by streamlining the process and opening new avenues for monetization. Token gating, which allows access only to members with specific digital assets; “phygital” experiences that combine digital and physical worlds; and NFT ticketing, whichcreates tickets using blockchain technology, are just a few examples.\n\nIn short, the solution to community monetization complexities lies in an NFT-based model that integrates memberships, content, and events while reducing fees and enhancing the user experience.\nAddressing the monetization challenges faced by online communities,Belonguses Web3 technologies and NFTs to offer creators tools to manage memberships, events and exclusive content from a single point.\nThe platform uses NFTs to give community members exclusive access to content, events and interactions by requiring them to hold specific digital tokens. For users, a soulbound NFT —a nontransferable digital asset permanently tied to its owner— provides a unique collectible and serves as a pass to special events and more. These digital keys are stored securely in a user’s crypto wallet and integrated with both digital and physical realms.\n\nOne key benefit for users is Belong’s flexibility in payment options. Members can purchase or renew their access using Apple Pay, Google Pay, credit cards or cryptocurrencies. Moreover, with a 2% sales fee, communities are more likely to offer better deals and invest in creating high-quality experiences, knowing that more of their revenue stays within the community.\nBelong’s model encourages more creators to use the platform while increasing safety and exclusivity for members,leading to richer and more diverse communities for users to join.\nBelong enables communities to monetize private content by granting verified members access through token-gated systems. Educators can use this feature to offer exclusive courses or workshops, while influencers can engage with their dedicated followers through private chats. Similarly, artists and public figures can host virtual events, such as concerts or special announcements, that are accessible only to those holding specific tokens.\nIn addition to private content, the platform offers a unique model for event management through its NFT ticketing system.By issuing tickets as NFTs, Belong provides instant payouts and reduces fees for event organizers. Tickets are securely stored in attendees' crypto wallets, eliminating the need for third-party intermediaries and improving cash flow. The use of blockchain also automates processes such as ticket validation and attendee tracking, streamlining event management and reducing the risk of fraud.\n\nBelong’s use of NFTs extends beyond digital to physical spaces. With the upcoming integration of Apple Home, NFT memberships will serve as digital keys to access locations like coworking areas, gyms and clubhouses. The integration will allow users to unlock doors or gain entry to facilities simply by having their NFT in a compatible wallet, providing a modern structure and reducing the need for manual check-ins.\nFurther enhancing the connection between the digital and physical worlds, Belong improves theconcept of \"phygital\" goods. Through its approach, creators can sell physical merchandise, such as apparel or collectibles, by issuing NFTs that act as digital proof of purchase. When a user buys an NFT, it represents ownership of a digital asset and also serves as a voucher for a tangible product.\nThe combination of digital and physical experiences deepens the connection between creators and their communities, offering added value and exclusivity to collectors. This unique blend of digital and physical ownership strengthens the bond between creators and fans, adding a layer of exclusivity and prestige to the transactions.\nBelong addresses the modern challenges of community monetization by leveraging NFTs and Web3 technology to offer access management, exclusive memberships and unique “phygital” goods. With itspartnershipwith Skale, an on-demand blockchain network with zero gas fees, it will provide gasless transactions, making the entire process simple, fast and cost-effective.\nWith the Skale integration, Belong is one step closer to its goal of redefining the Web3 space and making community participation more accessible than ever. As other platforms struggle with high fees and inefficiencies, Belong’s gasless approach could set a new standard in the Web3 ecosystem.\nLooking ahead, the growth of platforms like Belong could redefine the future of digital economies and the merging of virtual and real-world experiences. As Web3 tools evolve, the potential of blending digital and physical economies could surpass expectations.\nDisclaimer.Cointelegraph does not endorse any content or product on this page. While we aim at providing you with all important information that we could obtain in this sponsored article, readers should do their own research before taking any actions related to the company and carry full responsibility for their decisions, nor can this article be considered as investment advice.",
        "link": "https://www.cointelegraph.com/news/the-rise-of-soulbound-nfts-unpacking-community-monetization-strategies",
        "date": "2024-10-22",
        "timestamp": "2024-10-23T01:00:50.363002+08:00"
    },
    {
        "title": "BitFuFu boosts Bitcoin mining with first physical facility in Ethiopia",
        "content": "BitFuFu is no longer exclusively a cloud miner as it transitions to a more resilient portfolio.\nCloud BitcoinBTC$67,305miner BitFuFu has acquired its first brick-and-mortar mining facility. The company is calling the acquisition of an 80-megawatt (MW) facility in Ethiopia the start of its infrastructure diversification. The value of the deal was not disclosed.\nNasdaq-listed, Singapore-based BitFuFu had 25 mining facilities as of June 30, all of which were hosted by third parties, with the majority located in the United States. Other facilities are located in Portugal and Indonesia.\nThe company will boost its capacity from 522 MW to over 600 MW with the new facility, which it intends to upgrade. The deployment of Bitmain S21 application-specific integrated circuit (ASIC) miners will potentially add 4.6 exahashes per second (EH/s) to its mining capacity.\nIn the second quarter of 2024, BitFuFu’s capacity under managementamounted to 24.7 EH/s. CEO Leo Lusaidin a statement:\n“This acquisition is a critical milestone as we work to vertically integrate and transition towards a more diversified and resilient portfolio of Bitcoin mining sites.”\n“We can capitalize on lower energy costs to reduce Bitcoin production expenses, expand our operational capacity, and enhance profitability” through the acquisition, he added.\nEnergy costs at the facility average below $0.04 per kilowatt-hour, which will reduce BitFuFu’s cost per Bitcoin. BitFuFu’s mining expenses had risen 168% year-on-year as of Q2 2024.\nSurging energy prices and the fourth Bitcoin halving cut deep into miners’ profits. Many miners have looked at computing diversification,moving into artificial intelligenceand high-performance computing.\nMiners with healthy cash reserveshave benefitted from the marketshakeup to double down on mining. BitFuFu was one of the miners to benefit from this strategy, increasing Q2 revenue by almost 70% year-on-year to $129.4 million.\nBitFuFu was founded by executives of Chinese hardware producer Bitmain, which made an early investment in the company. Bitmain remains BitFuFu’s strategic partner. Bitdeer is also a spinoff of Bitmain.\n",
        "link": "https://www.cointelegraph.com/news/bitfufu-acquires-ethiopian-bitcoin-mining-facility",
        "date": "2024-10-22",
        "timestamp": "2024-10-23T00:47:55.976192+08:00"
    },
    {
        "title": "Lightning Network value directly correlated to Bitcoin price: Report",
        "content": "“It’s like your dial-up internet became broadband because the Bitcoin price went up,” according to the CEO of Amboss Technologies.\nThe Lightning Network’s value is directly correlated with the Bitcoin price, according to a recent research report.\nThe report argues that max flow, which measures the network’s maximum transaction capacity, is the key metric for assessing the true value of the leading Bitcoinlayer-2 (L2) Lightning Network.\nThis means that theLightning Network’s value is directly scaling along with BitcoinBTC$67,305price appreciation, according to Jesse Shrader, the CEO and co-founder of Amboss Technologies.\nShrader told Cointelegraph:\n“The Lightning Network is currently optimized for micropayments, but as the Bitcoin price appreciates, the payments infrastructure scales alongside the price. Larger dollar payments start to act like micropayments with high performance compared to the increasingly valuable Lightning channels.”\n“It’s like your dial-up internet became broadband because the Bitcoin price went up,” he added.\nAssessing max flow will become key for measuring the Lightning Network’s increasing value, since traditional metrics like node and channel count are incomplete measures for the Bitcoin scalability layer, according to a research report shared by Amboss Technologies, a firm building Lightning Network infrastructure.\nMax flow can help assess the network’s payment reliability, showing how a transaction’s success probability changes with different payment sizes.\nThis is because node count doesn’t accurately measure how efficiently Bitcoin payments flow through the Lightning Network, which makes the L2 so valuable.\nBy measuring the success probability of a transaction, max flow helps assess the distribution of liquidity and identify potential bottlenecks, which can ultimately improve the network’s overall performance. The report said:\n“For example, if a channel holds 0.1 BTC and Bitcoin is priced at $50,000, that channel can route a $5,000 payment. If Bitcoin’s price doubles to $100,000, that same channel can handle $10,000—without any changes to the underlying infrastructure.”\nInstitutional crypto adoption will require a more reliable and scalable blockchain payment infrastructure.\nMore institutions may start flocking to the Lightning Network, thanks to the network’s growing channel capacity illustrated by the max flow metric. Shrader explained:\n“As channel capacity grows and liquidity becomes better distributed across the network, we could see more institutional flows tapping into the Lightning Network.”\nThe Lightning Network’s growing max flow could lead to reduced costs and easier transactions for institutions. He added:\n“Increased channel capacity also means that institutions can route larger payments with lower fees and without requiring frequent onchain transactions. This reduces costs and friction, potentially leading to more institutional activity offchain, as institutions use Lightning for settlement purposes.”\nAccording to DefiLlama data, the Lightning Network is worth over $346 million in terms of total value locked, making it the third-largest protocol built on the Bitcoin network.",
        "link": "https://www.cointelegraph.com/news/lightning-network-value-correlated-bitcoin-s-price",
        "date": "2024-10-22",
        "timestamp": "2024-10-23T00:39:09.517320+08:00"
    },
    {
        "title": "Peter Todd forced into hiding after HBO doc claims he invented Bitcoin",
        "content": "Documentary filmmaker Cullen Hoback stands by his allegation Todd is Satoshi Nakamoto despite his denial.\nCanadian cryptographer and computer scientist Peter Todd says he’s been forced into hiding for fear of his safety after an HBO documentary supposedly outed him as the inventor of BitcoinBTC$67,305.\nThe film, dubbed “Money Electric: The Bitcoin Mystery,” aired on Oct. 9 and was purported to finally reveal the mystery surrounding the true identity of “Satoshi Nakamoto,” the pseudonym of a person thought to be the inventor of Bitcoin.\nUltimately, after exploring other potential candidates, the documentaryended on a dubious notewith Todd stating “Well yeah, I’m Satoshi Nakamoto.”\nTodd has repeatedly denied that he is Satoshi Nakamoto and dismissed the film’s claims. According to a recent interview with Wired, he’s beenforcedinto hiding over fears for his safety. He says filmmaker Cullen Hoback, the documentary’s director, used specious evidence to support the documentary’s erroneous conclusion.\nHowever, according to several sources and footage shown in the documentary itself, Todd evidently has a history of jokingly stating “I am Satoshi.” These statements appear to have been made in the vein of the famous line “I am Spartacus” from the eponymous film.\nIn the 1960 action film “Spartacus,” a group of warriors are captured by Roman soldiers and offered mercy if they’ll identify and send forth the man known as Spartacus. In response, the warriors each claim, in turn, to be Spartacus as a sign of solidarity.\nAccording to Wired, Todd agreed to appear in the HBO documentary because he believed it was about the history of Bitcoin — as opposed to an attempted exposé. Todd says that not only has he been incorrectly identified as Nakamoto, but that his life is now in constant danger:\n“Obviously, falsely claiming that ordinary people of ordinary wealth are extraordinarily rich exposes them to threats like robbery and kidnapping. Not only is the question dumb, it's dangerous. Satoshi obviously didn't want to be found, for good reasons, and no one should help people trying to find Satoshi.”\nHowever, Electric Money’s director seemingly takes a different view. Wired reports that Hoback claims Todd and others have blown things out of proportion and that the idea of outing Nakamoto has, so far, posed no real threat to those investigated.\n“There’s potentially this anonymous figure out there who controls one-twentieth of the total supply of digital gold,” said Hoback. Adding that identifying this person “is pretty important.”\nWhile both men appear to be sticking to their stories, the so-called reveal doesn’t appear to have convinced many within the cryptocurrency community that Todd is, in fact, Satoshi Nakamoto.",
        "link": "https://www.cointelegraph.com/news/peter-todd-forced-hiding-hbo-doc-claims-invented-bitcoin",
        "date": "2024-10-22",
        "timestamp": "2024-10-23T00:39:05.632551+08:00"
    },
    {
        "title": "Price analysis 10/22: SPX, DXY, BTC, ETH, BNB, SOL, XRP, DOGE, TON, ADA",
        "content": "Bitcoin is finding support in the $66,500 to $65,000 zone and Bitcoin ETF inflows suggest traders are buying the dips. Will altcoins follow?\nBitcoinBTC$67,305has slipped below $67,000 after closing last week above $69,000, its strongest close since the start of June. However, the fall has not scared away the investors. According to Farside Investors data, United States-based Bitcoin exchange-traded funds witnessedinflows of $294.3 million on Oct. 21.\nUsually, after the price spends a long time in a range, it needs a strong trigger to break out from the sideways price action. The upcoming United States elections could act as a catalyst for a new trending move in Bitcoin. Many believe that a victory by the former US president and Republican nominee Donald Trumpcould propel Bitcoin higher.\nWhile Bitcoin’s long-term picture remains intact, theshort-term is showing signs of weakness. Popular X account Emperor told its followers that a drop to $62,000 to $63,000 could be a buying opportunity.\nCould Bitcoin and altcoins bounce off the current levels, or will they fall further? Let’s analyze the charts to find out.\nThe S&P 500 Index (SPX) is in an uptrend, but the rally is facing minor resistance at 5,878. The price could correct to the 20-day exponential moving average (5,774).\nIf the price rebounds off the 20-day EMA with force, it will signal that the sentiment remains bullish, and traders are buying on dips. The bulls will then make one more attempt to push the index to 6,000. Sellers will try to halt the rally at 6,000, but if the bulls prevail, the next stop could be 6,221.\nOn the contrary, a break below the 20-day EMA will weaken the bullish momentum. The index could then dive to the 50-day simple moving average (5,652).\nThe US Dollar Index (DXY) rose vertically after breaking out of the 101 level on Oct. 1. Buyers continued the momentum and pushed the price above the 103.54 resistance on Oct. 17.\nThe bears tried to tug the price back below the 103.54 level on Oct. 18, but the bulls held their ground. Buyers have kicked the price above the near-term resistance of 103.87, opening the doors for a rally to 105.\nThis optimistic view will be negated in the short term if the price turns down sharply and breaks below 103.42. The index may then slump to the 20-day EMA (102.75). Sellers will have to sink the index below the 20-day EMA to signal a comeback.\nBitcoin turned down sharply from the overhead resistance of $70,000, indicating that the bears are active at higher levels.\nThe $66,500 to $65,000 zone is likely to act as a support on the downside. If the price rebounds off the support zone with strength, it will signal a higher low formation. That will improve the prospects of a rally to $72,000. Buyers are expected to face significant resistance in the $72,000 to $73,777 zone.\nThe bullish momentum will weaken on a break and close below $65,000. The BTC/USDT pair could then sink to the 50-day SMA ($62,117).\nEtherETH$2,623.64broke above the resistance line of the symmetrical triangle on Oct. 20, but the bulls failed to push the price to $2,850.\nThe bears are trying to yank the price below the 20-day EMA ($2,573). If they can pull it off, it will signal that the markets have rejected the breakout. The ETH/USDT pair could then slide to the 50-day SMA ($2,485).\nContrary to this assumption, if the price bounces off the 20-day EMA with strength, it will indicate buying on dips. The bulls will then again try to propel the pair above the $2,850 resistance and start the rally to $3,400.\nBNBBNB$594.98turned down from $612 on Oct. 21, indicating that the bears are fiercely defending the overhead resistance at $635.\nThe first support on the downside is the 20-day EMA ($585). If the price bounces off the 20-day EMA with strength, it will signal a positive sentiment. Buyers will then again attempt to overcome the barrier at $635. If they succeed, the BNB/USDT pair could accelerate toward $722.\nConversely, if the 20-day EMA cracks, the pair may drop to the 50-day SMA ($564) and later to $527. That will indicate the pair may remain stuck inside the range for some more time.\nSolanaSOL$166.70closed above the $164 overhead resistance on Oct. 20, completing a bullish ascending triangle pattern.\nHowever, the bears are putting up a tough fight and are trying to pull the price back below $164. If bulls successfully defend the $164 level, it increases the likelihood of a rally to $189.\nConversely, if the price dips and maintains below $164, it suggests that the markets have rejected the breakout. The SOL/USDT pair could then descend to the 20-day EMA ($153). If the price bounces off the 20-day EMA, the bulls will make one more attempt to start the up move by pushing the pair above $172.\nXRPXRP$0.5334bounced off the uptrend line on Oct. 20, but the bulls could not push the price above the 50-day SMA ($0.56).\nThe bears will try to seize the advantage by pulling the price below the uptrend line. If that happens, the XRP/USDT pair could drop to $0.50. Buyers have protected the $0.50 level on two previous occasions. Hence, they will again try to do that.\nAlternatively, if the price turns up from the uptrend line and breaks above the 50-day SMA, it will signal that the bulls are back in the game. The pair will then try to reach the overhead resistance of $0.64.\nDogecoinDOGE$0.1387rose above the symmetrical triangle pattern on Oct. 18, but the rally is facing resistance near $0.15.\nThe DOGE/USDT pair could retest the breakout level from the triangle. If the price rebounds off the resistance line, it will signal that the bulls have flipped the level into support. Buyers will then again try to thrust the price above $0.15. If they succeed, the pair could rally to $0.18.\nThis positive view will be invalidated in the near term if the price turns down and breaks below the 20-day EMA ($0.12). The pair may then plummet to the support line of the triangle.\n\nBuyers have failed to push ToncoinTON$5.23above the moving averages, indicating a lack of demand at higher levels.\nThe bears will try to drag the price below the $5 support. If they can pull it off, the pair may retest the $4.72 to $4.44 support zone. This is an essential level to watch out for because a break and close below the zone will complete a bearish head-and-shoulders pattern, starting a downtrend.\nIf the bulls want to prevent the downside, they will have to quickly drive the TON/USDT pair above the moving averages. The pair could then rise to $6 and subsequently to $7, which is likely to act as a solid hurdle.\nCardanoADA$0.3637broke above the moving averages on Oct. 20, but the bears have not allowed the price to sustain above the $0.37 resistance.\nThe flattish moving averages and the RSI near the midpoint do not give a clear advantage either to the bulls or the bears. If the price turns up from the current level and breaks above $0.37, the ADA/USDT pair could rally to the overhead resistance at $0.40.\nContrarily, if the price skids below the moving averages, the bears will try to sink the pair below $0.33. If they do that, the pair may decline to $0.31, where the buyers are expected to mount a strong defense.",
        "link": "https://www.cointelegraph.com/news/price-analysis-10-21-spx-dxy-btc-eth-bnb-sol-xrp-doge-ton-ada",
        "date": "2024-10-22",
        "timestamp": "2024-10-23T00:39:01.200295+08:00"
    }
]